rhoReactingBuoyantFoam/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.79;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
      "side.*"
    {
        type            inletOutlet;
        inletValue      uniform 0.79;
        value           uniform 0.79;

    }
    "container.*|base|ground"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
