rhoReactingBuoyantFoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 292;

boundaryField
{
  inlet
  {
    type            fixedValue;
    value           uniform 292;
  }

    "side.*"
  {
    type            inletOutlet;
    inletValue      uniform 292;
    value           uniform 292;
  }

  "container.*|base|ground"
  {
    type      zeroGradient;
  }
}


// ************************************************************************* //
