rhoReactingBuoyantFoam/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
  inlet
  {
    type            zeroGradient;
  }

//   "side.*"
// {
//   type            totalPressure;
//   p0              $internalField;
// }

    "side.*"
  {
    type            fixedValue;
    value           $internalField;
  }

  "container.*|base|ground"
  {
    type            zeroGradient;
  }
}


// ************************************************************************* //
