rhoReactingBuoyantFoam/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// combustionModel  laminar<rhoChemistryCombustion>;
// combustionModel  diffusion<rhoThermoCombustion,constGasHThermoPhysics>;
// combustionModel  diffusion<rhoThermoCombustion,constGasHThermoPhysics>
// combustionModel  diffusion<rhoThermoCombustion,gasEThermoPhysics>
// combustionModel  PaSR<rhoChemistryCombustion>
// combustionModel  diffusion<rhoThermoCombustion,gasHThermoPhysics>
combustionModel  noCombustion<rhoThermoCombustion>;

// active  true;
// semiImplicit true;



// ************************************************************************* //
